InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/СерверныеФункции/Ext/Module.bsl
Функция ПолучитьКонстантуИзменЦены(Отделение) Экспорт
	Если Отделение="Аптечный пункт №1" Тогда
		Возврат(Константы.КоэффициентИзмененияЦеныОтделения1.Получить());
	Иначе
		Возврат(Константы.КоэффициентИзмененияЦеныОтделения2.Получить());	
	КонецЕсли
КонецФункции

Функция РозничнаяЦена(АктуальнаяДата,Товар) Экспорт
	Отбор=Новый Структура("Товар",Товар);
	ЗначенияРесурсов=РегистрыСведений.Цены.
	ПолучитьПоследнее(АктуальнаяДата,Отбор);
	Возврат ЗначенияРесурсов.Цена;
КонецФункции
